app/controllers/application_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "abhishek@zennode.com"], ["LIMIT", 1]]
---
  def current_user
    User.find_by_email(session['user'])