app/controllers/todos_controller.rb

SELECT "todos".* FROM "todos" WHERE "todos"."assignee" = $1 ORDER BY "todos"."id" DESC  [["assignee", 1]]
---
   def index
     if params[:assignee].present?
       @todos = Todo.where(:assignee => params[:assignee]).order(:id => "desc")
     else
       @todos = Todo.all.order(:id => "desc")

INSERT INTO "todos" ("body", "status", "assignee", "reporter", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["body", "test"], ["status", 0], ["assignee", 2], ["reporter", 1], ["created_at", "2020-11-18 06:08:41.267220"], ["updated_at", "2020-11-18 06:08:41.267220"]]
---
  def create
    todo = current_user.reported_todos.create(permitted_params)

SELECT  "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
UPDATE "todos" SET "body" = $1, "updated_at" = $2 WHERE "todos"."id" = $3  [["body", "test for sharath test"], ["updated_at", "2021-07-08 10:22:35.698637"], ["id", 9]]
---
  def update
    todo = Todo.find(params[:id])
    if todo.update(permitted_params)

SELECT  "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "todos" SET "status" = $1, "updated_at" = $2 WHERE "todos"."id" = $3  [["status", 1], ["updated_at", "2020-11-18 06:10:10.674616"], ["id", 1]]
---
  def update_status
    todo = Todo.find(params[:id])
    todo.update_attributes(:status => params[:status])